test_inlet2/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 2.3039e-5;

boundaryField
{
	// LeftandRight
	// {
	// 	type compressible::alphatJayatillekeWallFunction;
	// 	Prt 0.71;
	// 	value $internalField;
	// }

	// frontAndBack
	// {
	// 	type compressible::alphatJayatillekeWallFunction;
    //     Prt 0.71;
    //             value $internalField;
	// }
	RoomWall
	{
		type compressible::alphatJayatillekeWallFunction;
        Prt 0.71;
                value $internalField;
	}

	
	Baffle
	{
		type compressible::alphatJayatillekeWallFunction;
        Prt 0.71;
                value $internalField;
	}
	hot
	{
		type compressible::alphatJayatillekeWallFunction;
                Prt 0.71;
                value $internalField;
	}

	cold
	{
		type compressible::alphatJayatillekeWallFunction;
                Prt 0.71;
                value $internalField;
	}

	inlet
	{
		type fixedValue;
		value $internalField;
	}

	outlet
	{
	        type zeroGradient;
	}




}



// ************************************************************************* //
