test_inlet2/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    // LeftandRight
    // {
    //     type            nutkWallFunction;
    //     value           uniform 0;
    // }
    // frontAndBack
    // {
    //     type            nutkWallFunction;
    //     value           uniform 0;
    // }

    RoomWall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    Baffle
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    inlet
    {
	    type calculated;
	    value $internalField;
    }
    outlet
    {
	    type zeroGradient;
    }
    hot
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    cold
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

}


// ************************************************************************* //
