test_inlet2/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
	// LeftandRight
	// {
	// 	type zeroGradient;
	// }
        // frontAndBack
        // {
        //         type zeroGradient;
        // }

	RoomWall
	{
		type zeroGradient;
	}
        Baffle
        {
                type zeroGradient;
        }

        inlet
        {
                type zeroGradient;
        }

        hot
        {
                type zeroGradient;
        }
        cold
        {
                type zeroGradient;
        
	}
	outlet
	{
		type fixedValue;
		value $internalField;
	}

}

// ************************************************************************* //
